---
kind: enumMember
id: F:Autodesk.Revit.DB.ExternalResourceLoadStatus.Uninitialized
enum: Autodesk.Revit.DB.ExternalResourceLoadStatus
source: html/2f8c9146-6ae2-49a7-0a8b-cd544077602e.htm
---
# Autodesk.Revit.DB.ExternalResourceLoadStatus.Uninitialized

The load operation is in an incomplete state.
 Revit will treat this result as a failure.